<font color="blue">To use this notebook on Colaboratory, you will need to make a copy of it. Go to File > Save a Copy in Drive. You can then use the new copy that will appear in the new tab.</font>

# Essentials SQL Notebook - SQL Basics for Data Science

## Connecting to our database

In [2]:
# We will start our practice work by first loading an sql extension. 
# Notebook extensions are simple add-ons that extend the basic functionality 
# of the notebook environment. This extension will allow us to run SQL code in our Notebook.
# ---
#
%load_ext sql

In [3]:
# We then connect to an in memory SQLite database within colaboratory. 
# This in memory dataset will be deleted as soon the dataset connection is lost, 
# meaning when our connection to the servers is disconnected then our database will cease to exist.
# ---
#  
%sql sqlite://

'Connected: @None'

## 1. Loading our dataset

In [4]:
# To read our csv file from an external source into our colaboratory environment, 
# we will use the pandas library for data maninupation. So, let's load it.
# Don't worry about this library now, we will cover it in future sessions.
# ---
#
import pandas as pd

### <font color="blue">Example</font>

In [5]:
# Example 
# ---
# We will load our first dataset from a csv file as shown and afterwords, 
# store that dataset in our in memory sqlite database.
# ---

# We read our dataset from its source and store it in a dataframe called cities.
# ---
#
cities = pd.read_csv('http://bit.ly/CItiesDB') 

# We then delete the table if it exists in our database
# ---
#
%sql DROP TABLE if EXISTS cities;

# We then store this table in a table called 'cities' within our in memory dataset.
# The persist command that we will create will help us do this. 
# NB: The table name will be the same as variable name above.
# ---
#
%sql PERSIST cities;

# We can then select the first five records of our created cities table.
# This will help us know whether our table was created.
# ---
#
%sql SELECT * FROM cities LIMIT 5;

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.

[(0, 'Aalborg', 'Denmark', 57.03, 9.92, 7.52),
 (1, 'Aberdeen', 'United Kingdom', 57.17, -2.08, 8.1),
 (2, 'Abisko', 'Sweden', 63.35, 18.83, 0.2),
 (3, 'Adana', 'Turkey', 36.99, 35.32, 18.67),
 (4, 'Albacete', 'Spain', 39.0, -1.87, 12.62)]

### <font color="green">Challenge</font>

In [6]:
# Challenge: 
# ---
# Question: Load and check the countries dataset from the following url
# ---
# Dataset url = http://bit.ly/CountriesDB1
# ---
# YOUR CODE GOES BELOW
# ---
#

countries = pd.read_csv('http://bit.ly/CountriesDB1')

%sql DROP TABLE if EXISTS countries;


% sql PERSIST countries;

%sql SELECT * FROM countries LIMIT 5;

 * sqlite://
Done.
 * sqlite://
 * sqlite://
Done.

[(0, 'Albania', 2.9, 'no', 'yes'),
 (1, 'Andorra', 0.07, 'no', 'no'),
 (2, 'Austria', 8.57, 'yes', 'no'),
 (3, 'Belarus', 9.48, 'no', 'no'),
 (4, 'Belgium', 11.37, 'yes', 'yes')]

## 2. Selecting data from a table

###<font color="blue">Examples</font>

In [11]:
# Example 1: We can select all records from a columns as shown:
# ---
# Selecting all records from the temperature column.
# ---
#
%%sql
SELECT temperature FROM cities;

 * sqlite://
Done.

[(7.52,),
 (8.1,),
 (0.2,),
 (18.67,),
 (12.62,),
 (17.38,),
 (10.17,),
 (8.93,),
 (13.52,),
 (9.6,),
 (10.98,),
 (9.86,),
 (11.88,),
 (9.32,),
 (17.41,),
 (4.54,),
 (7.51,),
 (15.61,),
 (8.87,),
 (8.23,),
 (15.78,),
 (15.15,),
 (6.68,),
 (14.16,),
 (8.48,),
 (9.85,),
 (9.12,),
 (1.75,),
 (8.72,),
 (6.07,),
 (8.78,),
 (6.98,),
 (11.41,),
 (8.81,),
 (9.15,),
 (4.5,),
 (11.69,),
 (8.63,),
 (11.87,),
 (8.23,),
 (9.97,),
 (8.39,),
 (13.42,),
 (9.78,),
 (9.65,),
 (8.14,),
 (11.02,),
 (6.73,),
 (7.86,),
 (9.65,),
 (10.59,),
 (9.55,),
 (11.93,),
 (10.45,),
 (11.16,),
 (7.14,),
 (7.66,),
 (9.96,),
 (9.25,),
 (17.32,),
 (15.04,),
 (8.05,),
 (7.19,),
 (5.92,),
 (7.06,),
 (8.6,),
 (11.24,),
 (9.41,),
 (16.6,),
 (10.51,),
 (5.38,),
 (8.87,),
 (15.02,),
 (8.69,),
 (8.49,),
 (6.4,),
 (7.43,),
 (10.9,),
 (15.18,),
 (6.68,),
 (7.4,),
 (8.67,),
 (5.17,),
 (11.11,),
 (10.14,),
 (13.83,),
 (7.98,),
 (6.68,),
 (10.0,),
 (13.46,),
 (8.4,),
 (12.94,),
 (8.6,),
 (5.76,),
 (16.33,),
 (6.91,),
 (8.4,),
 (8.71,),
 (9.65,),
 (8.47,),
 (4.19,),
 (7.12,),
 (6.07,),
 (17.09,),
 (7.57,),
 (4.54,),
 (8.0,),
 (13.2,),
 (17.3,),
 (10.41,),
 (8.88,),
 (6.05,),
 (8.89,),
 (8.64,),
 (7.29,),
 (6.88,),
 (-2.2,),
 (7.0,),
 (7.31,),
 (7.73,),
 (7.43,),
 (8.61,),
 (10.59,),
 (9.65,),
 (10.32,),
 (6.79,),
 (15.52,),
 (9.27,),
 (7.04,),
 (8.63,),
 (11.19,),
 (8.26,),
 (8.7,),
 (14.13,),
 (7.33,),
 (15.1,),
 (17.19,),
 (14.98,),
 (6.25,),
 (16.54,),
 (8.88,),
 (6.65,),
 (5.28,),
 (11.11,),
 (6.68,),
 (15.0,),
 (8.82,),
 (9.36,),
 (10.34,),
 (7.73,),
 (11.92,),
 (4.93,),
 (2.32,),
 (7.66,),
 (1.45,),
 (10.85,),
 (17.9,),
 (16.9,),
 (10.95,),
 (11.7,),
 (15.13,),
 (6.42,),
 (10.51,),
 (8.27,),
 (9.99,),
 (8.31,),
 (8.05,),
 (9.4,),
 (5.16,),
 (9.27,),
 (6.76,),
 (15.1,),
 (8.07,),
 (10.59,),
 (11.63,),
 (4.62,),
 (12.05,),
 (13.4,),
 (9.6,),
 (6.97,),
 (12.48,),
 (8.05,),
 (9.36,),
 (12.46,),
 (10.9,),
 (5.53,),
 (6.26,),
 (6.28,),
 (9.73,),
 (10.34,),
 (4.82,),
 (3.59,),
 (11.21,),
 (4.36,),
 (13.02,),
 (10.25,),
 (10.28,),
 (11.21,),
 (16.0,),
 (4.53,),
 (4.72,),
 (4.17,),
 (16.02,),
 (7.86,),
 (12.85,),
 (5.38,),
 (7.2,),
 (7.17,),
 (10.02,),
 (14.17,),
 (6.67,),
 (10.64,),
 (6.68,)]

In [12]:
# Example 2: We can limit the no. of fetched records using the LIMIT keyword as shown:
# ---
#
%%sql
SELECT temperature FROM cities LIMIT 5;

 * sqlite://
Done.

[(7.52,), (8.1,), (0.2,), (18.67,), (12.62,)]

In [13]:
# Example 3: We can select distinct items from a single column using the DISTINCT keyword as shown:
# ---  
#
%%sql
SELECT DISTINCT country FROM cities;

 * sqlite://
Done.

[('Denmark',),
 ('United Kingdom',),
 ('Sweden',),
 ('Turkey',),
 ('Spain',),
 ('France',),
 ('Netherlands',),
 ('Italy',),
 ('Andorra',),
 ('Romania',),
 ('Greece',),
 ('Germany',),
 ('Moldova',),
 ('Switzerland',),
 ('Serbia',),
 ('Norway',),
 ('Poland',),
 ('Ukraine',),
 ('Portugal',),
 ('Slovakia',),
 ('Belarus',),
 ('Czech Republic',),
 ('Belgium',),
 ('Hungary',),
 ('Bulgaria',),
 ('Ireland',),
 ('Latvia',),
 ('Albania',),
 ('Austria',),
 ('Finland',),
 ('Lithuania',),
 ('Slovenia',),
 ('Montenegro',),
 ('Croatia',),
 ('Bosnia and Herzegovina',),
 ('Macedonia',),
 ('Estonia',)]

In [15]:
# Example 4: We can use conditions to select records through the use of the WHERE clause as shown:
# ---  
# 
%%sql
SELECT * FROM cities WHERE country = 'Sweden';

 * sqlite://
Done.

[(2, 'Abisko', 'Sweden', 63.35, 18.83, 0.2),
 (93, 'Gteborg', 'Sweden', 57.75, 12.0, 5.76),
 (116, 'Kiruna', 'Sweden', 67.85, 20.22, -2.2),
 (134, 'Malm', 'Sweden', 55.58, 13.03, 7.33),
 (186, 'Stockholm', 'Sweden', 59.35, 18.1, 6.26),
 (201, 'Uppsala', 'Sweden', 59.86, 17.64, 4.17)]

In [16]:
# Example 5: We can order our records through the use of the ORDER BY clause and using ASC or DESC as shown:
# ---  
# 
%%sql
SELECT * FROM cities WHERE country = 'Sweden' ORDER BY temperature ASC;

 * sqlite://
Done.

[(116, 'Kiruna', 'Sweden', 67.85, 20.22, -2.2),
 (2, 'Abisko', 'Sweden', 63.35, 18.83, 0.2),
 (201, 'Uppsala', 'Sweden', 59.86, 17.64, 4.17),
 (93, 'Gteborg', 'Sweden', 57.75, 12.0, 5.76),
 (186, 'Stockholm', 'Sweden', 59.35, 18.1, 6.26),
 (134, 'Malm', 'Sweden', 55.58, 13.03, 7.33)]

In [17]:
# Example 6: We can count selected items through the use of COUNT() function as shown:
# --- 
# 
%%sql
SELECT count(*) 
FROM cities 
WHERE country = 'Sweden' 
ORDER BY temperature 
ASC;

 * sqlite://
Done.

[(6,)]

In [18]:
# Example 7
# ---
# We select records with values between certain boundaries in a column through
# the BETWEEN AND keywords as shown:
# ---
# 
%%sql
SELECT * FROM cities 
WHERE temperature 
BETWEEN 17 AND 20 
ORDER BY country 
DESC;

 * sqlite://
Done.

[(3, 'Adana', 'Turkey', 36.99, 35.32, 18.67),
 (5, 'Algeciras', 'Spain', 36.13, -5.47, 17.38),
 (59, 'Cartagena', 'Spain', 37.6, -0.98, 17.32),
 (103, 'Huelva', 'Spain', 37.25, -6.93, 17.09),
 (136, 'Marbella', 'Spain', 36.52, -4.88, 17.19),
 (156, 'Palermo', 'Italy', 38.13, 13.35, 17.9),
 (14, 'Athens', 'Greece', 37.98, 23.73, 17.41),
 (108, 'Kalamata', 'Greece', 37.04, 22.11, 17.3)]

In [19]:
# Example 8
# ---
# We select records between certain boundaries and not have having certain values 
# in a column using the AND NOT keywords as shown:
# ---
# 
%%sql
SELECT * 
FROM cities 
WHERE temperature 
BETWEEN 17 AND 20 
AND NOT longitude < 10
ORDER BY country DESC;

 * sqlite://
Done.

[(3, 'Adana', 'Turkey', 36.99, 35.32, 18.67),
 (156, 'Palermo', 'Italy', 38.13, 13.35, 17.9),
 (14, 'Athens', 'Greece', 37.98, 23.73, 17.41),
 (108, 'Kalamata', 'Greece', 37.04, 22.11, 17.3)]

In [20]:
# Example 9
# ---
# We can select records with null values as shown below:
# ---
#
%%sql
SELECT * FROM cities WHERE temperature IS NULL;

 * sqlite://
Done.

[]

In [21]:
# Example 10
# ---
# We can again select records with no null values as shown:
# ----
# This time we limit the fetched records because 
# we might expect to have many records returned.
# ---
# Challenge: You can also change the code to counting how many records 
# we have using the COUNT() keyword.
# ---
#
%%sql
SELECT * FROM cities 
WHERE temperature IS NOT NULL LIMIT 5;

 * sqlite://
Done.

[(0, 'Aalborg', 'Denmark', 57.03, 9.92, 7.52),
 (1, 'Aberdeen', 'United Kingdom', 57.17, -2.08, 8.1),
 (2, 'Abisko', 'Sweden', 63.35, 18.83, 0.2),
 (3, 'Adana', 'Turkey', 36.99, 35.32, 18.67),
 (4, 'Albacete', 'Spain', 39.0, -1.87, 12.62)]

In [22]:
# Example 11
# ---
# We can select multiple fields FROM a table as shown. 
# ---
#  
%%sql
SELECT city, temperature FROM cities 
ORDER BY temperature DESC 
LIMIT 5;

 * sqlite://
Done.

[('Adana', 18.67),
 ('Palermo', 17.9),
 ('Athens', 17.41),
 ('Algeciras', 17.38),
 ('Cartagena', 17.32)]

### <font color="green">Challenges</font>

<font color="blue">Your will be required to use countries dataset that you loaded in the first challenge earlier.</font>

In [24]:
# Challenge 1
# ---
# Question: Select the first 5 records from the countries dataset.
# ---
# YOUR CODE GOES BELOW 
# 

%%sql
SELECT * FROM countries LIMIT 5;

 * sqlite://
Done.

[(0, 'Albania', 2.9, 'no', 'yes'),
 (1, 'Andorra', 0.07, 'no', 'no'),
 (2, 'Austria', 8.57, 'yes', 'no'),
 (3, 'Belarus', 9.48, 'no', 'no'),
 (4, 'Belgium', 11.37, 'yes', 'yes')]

In [30]:
# Challenge 2
# ---
# Question: How many countries are there in the eu from the given countries dataset?
# ---
# YOUR CODE GOES BELOW 
# 
%%sql
SELECT COUNT(*)FROM countries WHERE EU = "yes"

 * sqlite://
Done.

[(27,)]

In [32]:
# Challenge 3
# ---
# Question: Which countries had a population less than 3.0 and had a coastline?
# ---
# YOUR CODE GOES BELOW 
# 

%%sql

SELECT * FROM countries WHERE population < 3.0 AND coastline = "no";

 * sqlite://
Done.

[(1, 'Andorra', 0.07, 'no', 'no'),
 (20, 'Kosovo', 1.91, 'no', 'no'),
 (22, 'Liechtenstein', 0.04, 'no', 'no'),
 (24, 'Luxembourg', 0.58, 'yes', 'no'),
 (25, 'Macedonia', 2.08, 'no', 'no')]

In [39]:
# Challenge 4
# ---
# Question: Which countries had the most population but were not in the eu?
# ---
# YOUR CODE GOES BELOW 
# 
# TO select the country with the highest population

# --- SELECT MAX(population) FROM countries WHERE EU ="no"

# To select the top five countries with the most population
%%sql
SELECT * FROM countries WHERE EU ="no" ORDER BY population DESC LIMIT 5;

 * sqlite://
Done.

[(39, 'Turkey', 79.62, 'no', 'yes'),
 (40, 'Ukraine', 44.62, 'no', 'yes'),
 (3, 'Belarus', 9.48, 'no', 'no'),
 (33, 'Serbia', 8.81, 'no', 'no'),
 (38, 'Switzerland', 8.38, 'no', 'no')]

In [ ]:
# Challenge 5
# ---
# Question: Which three eu countries have the least population?
# ---
# YOUR CODE GOES BELOW 
# 

%%sql

SELECT * FROM countries WHERE EU ="yes" ORDER BY population ASC LIMIT 3;

In [56]:
# Challenge 6
# ---
# Question: Does your countries dataset have any missing records?
# ---
# YOUR CODE GOES BELOW 
# 

# SELECT * FROM countries WHERE coalesce(population,EU,country,coastline) IS NULL
# SELECT * FROM countries WHERE population||EU||country||coastline IS NULL
%%sql

SELECT * FROM countries WHERE coalesce(population,EU,country,coastline) IS NULL

 * sqlite://
Done.

[]

## 3. Inserting data to a table

### <font color="blue">Examples</font>

In [7]:
# Example 1
# ---
# Then we will insert new data into our table and noting the added record 
# city        = 'Palanga'
# country     = 'Lithuania'
# latitude    = '22'
# longitude   = 12.1
# temperature = 21 
# ---
#
%%sql
INSERT INTO cities (city, country, latitude, longitude, temperature)
VALUES ('Palanga', 'Lithuania', 22, 12.1, 15);

SELECT * FROM cities WHERE city = "Palanga";

 * sqlite://
1 rows affected.
Done.

[(None, 'Palanga', 'Lithuania', 22.0, 12.1, 15.0)]

In [8]:
# Example 2
# ---
# Then we will insert new data into our table and noting all the values of the added record
# city        = 'Prizren'
# country     = 'Kosovo'
# latitude    = '22' 
# ---  
# 
%%sql
INSERT INTO cities (city, country, latitude)
VALUES ('Prizren', 'Kosovo', 22);

SELECT * FROM cities WHERE city = "Prizren";

 * sqlite://
1 rows affected.
Done.

[(None, 'Prizren', 'Kosovo', 22.0, None, None)]

### <font color="green">Challenges</font>

In [11]:
# Challenge 1
# ---
# Question: Insert the following data into our countries table.
# country    = 'Kosovo'
# population = '2'
# eu         = no
# coastline  = no
# ---
# 
%%sql

INSERT INTO countries (country, population,EU,coastline)
VALUES ("Kosovo", "2", "no", "no");

SELECT * FROM countries WHERE country = "Kosovo";

 * sqlite://
1 rows affected.
Done.

[(20, 'Kosovo', 1.91, 'no', 'no'),
 (None, 'Kosovo', 2.0, 'no', 'no'),
 (None, 'Kosovo', 2.0, 'no', 'no')]

## 4. Updating data in a table

### <font color="blue">Examples</font>

In [12]:
# Example 1
# ---
# Let's update a record in our cities table
# ---
# 
%%sql
UPDATE cities
SET temperature = 3.0
WHERE country = "Albania";

SELECT * FROM cities WHERE country = "Albania";

 * sqlite://
1 rows affected.
Done.

[(78, 'Elbasan', 'Albania', 41.12, 20.08, 3.0)]

In [13]:
# Example 2
# ---
# Let's update a record in our cities tables
# ---
#
%%sql
UPDATE cities
SET latitude = 41.12, longitude = 20.09
WHERE "city" = "Elbasan";

SELECT * FROM cities WHERE country = "Albania";

 * sqlite://
1 rows affected.
Done.

[(78, 'Elbasan', 'Albania', 41.12, 20.09, 3.0)]

### <font color="green">Challenges</font>

In [15]:
# Challenge 1
# ---
# Question: Update the population of Austria to 9.0 in the countries table.
# --- 
# YOUR CODE GOES BELOW
# 

%%sql
UPDATE countries 
SET population = 9.0 
WHERE country = "Austria";

SELECT * FROM countries WHERE country = "Austria";

 * sqlite://
1 rows affected.
Done.

[(2, 'Austria', 9.0, 'yes', 'no')]

## 5. Performing calculations with SQL

### <font color="blue">Examples</font>

In [16]:
# Example 1
# ---
# We can find the average by using the AVG() function as shown
# ---
# 
%%sql
SELECT MAX(temperature) FROM cities;

 * sqlite://
Done.

[(18.67,)]

In [19]:
# Example 2
# ---
# Which city had the highest temperature?
# ---
# 
%%sql 
SELECT city, MAX(temperature) FROM cities;

 * sqlite://
Done.

[('Adana', 18.67)]

In [23]:
# Example 3
# ---
# Find the average temperature for each country
# ---
# 
%%sql
SELECT country, AVG(temperature)
FROM cities
GROUP BY country

 * sqlite://
Done.

[('Albania', 3.0),
 ('Andorra', 9.6),
 ('Austria', 6.144),
 ('Belarus', 5.946666666666666),
 ('Belgium', 9.65),
 ('Bosnia and Herzegovina', 9.6),
 ('Bulgaria', 10.44),
 ('Croatia', 10.865),
 ('Czech Republic', 7.8566666666666665),
 ('Denmark', 7.625),
 ('Estonia', 4.59),
 ('Finland', 3.4875),
 ('France', 10.151111111111112),
 ('Germany', 7.869285714285714),
 ('Greece', 16.9025),
 ('Hungary', 9.6025),
 ('Ireland', 9.299999999999999),
 ('Italy', 13.474666666666668),
 ('Kosovo', None),
 ('Latvia', 5.27),
 ('Lithuania', 8.3575),
 ('Macedonia', 9.36),
 ('Moldova', 8.415),
 ('Montenegro', 9.99),
 ('Netherlands', 8.756666666666668),
 ('Norway', 3.7260000000000004),
 ('Poland', 7.250000000000002),
 ('Portugal', 14.469999999999999),
 ('Romania', 9.224444444444444),
 ('Serbia', 9.85),
 ('Slovakia', 8.48),
 ('Slovenia', 9.27),
 ('Spain', 14.238333333333332),
 ('Sweden', 3.5866666666666673),
 ('Switzerland', 7.253333333333333),
 ('Turkey', 11.726666666666665),
 ('Ukraine', 7.420000000000002),
 ('United Kingdom', 8.649999999999999)]

### <font color="green">Challenges</font>

In [32]:
# Challenge 1
# ---
# Question: What is the average population of EU with a coastline?
# ---
# YOUR CODE GOES BELOW
#
%%sql

SELECT country, AVG(population), EU FROM countries WHERE EU = "yes" GROUP BY country

 * sqlite://
Done.

[('Austria', 9.0, 'yes'),
 ('Belgium', 11.37, 'yes'),
 ('Bulgaria', 7.1, 'yes'),
 ('Croatia', 4.23, 'yes'),
 ('Cyprus', 1.18, 'yes'),
 ('Czech Republic', 10.55, 'yes'),
 ('Denmark', 5.69, 'yes'),
 ('Estonia', 1.31, 'yes'),
 ('Finland', 5.52, 'yes'),
 ('France', 64.67, 'yes'),
 ('Germany', 80.68, 'yes'),
 ('Greece', 10.92, 'yes'),
 ('Hungary', 9.82, 'yes'),
 ('Ireland', 4.71, 'yes'),
 ('Italy', 59.8, 'yes'),
 ('Latvia', 1.96, 'yes'),
 ('Lithuania', 2.85, 'yes'),
 ('Luxembourg', 0.58, 'yes'),
 ('Netherlands', 16.98, 'yes'),
 ('Poland', 38.59, 'yes'),
 ('Portugal', 10.3, 'yes'),
 ('Romania', 19.37, 'yes'),
 ('Slovakia', 5.43, 'yes'),
 ('Slovenia', 2.07, 'yes'),
 ('Spain', 46.06, 'yes'),
 ('Sweden', 9.85, 'yes'),
 ('United Kingdom', 65.11, 'yes')]

In [49]:
# Challenge 2
# ---
# Question: Which EU countries had temperature above the average? 
# ---
# YOUR CODE GOES BELOW
#
%%sql 

SELECT cities.country, cities.temperature, countries.eu

FROM cities

INNER JOIN countries ON cities.country = countries.country 

WHERE EU= "yes" AND temperature > (select avg(temperature)from cities)

 * sqlite://
Done.

[('Belgium', 9.65, 'yes'),
 ('Bulgaria', 10.51, 'yes'),
 ('Bulgaria', 10.59, 'yes'),
 ('Bulgaria', 10.9, 'yes'),
 ('Bulgaria', 11.93, 'yes'),
 ('Croatia', 12.46, 'yes'),
 ('France', 9.65, 'yes'),
 ('France', 9.96, 'yes'),
 ('France', 10.17, 'yes'),
 ('France', 10.25, 'yes'),
 ('France', 10.32, 'yes'),
 ('France', 10.59, 'yes'),
 ('France', 10.95, 'yes'),
 ('France', 10.98, 'yes'),
 ('France', 11.02, 'yes'),
 ('France', 11.11, 'yes'),
 ('France', 11.87, 'yes'),
 ('France', 14.98, 'yes'),
 ('Greece', 16.0, 'yes'),
 ('Greece', 16.9, 'yes'),
 ('Greece', 17.3, 'yes'),
 ('Greece', 17.41, 'yes'),
 ('Hungary', 9.55, 'yes'),
 ('Hungary', 9.65, 'yes'),
 ('Hungary', 10.34, 'yes'),
 ('Ireland', 10.0, 'yes'),
 ('Italy', 11.21, 'yes'),
 ('Italy', 11.69, 'yes'),
 ('Italy', 11.7, 'yes'),
 ('Italy', 12.94, 'yes'),
 ('Italy', 13.52, 'yes'),
 ('Italy', 13.83, 'yes'),
 ('Italy', 15.04, 'yes'),
 ('Italy', 15.1, 'yes'),
 ('Italy', 15.13, 'yes'),
 ('Italy', 15.15, 'yes'),
 ('Italy', 16.54, 'yes'),
 ('Italy', 16.6, 'yes'),
 ('Italy', 17.9, 'yes'),
 ('Lithuania', 15.0, 'yes'),
 ('Portugal', 13.42, 'yes'),
 ('Portugal', 15.52, 'yes'),
 ('Romania', 9.78, 'yes'),
 ('Romania', 10.51, 'yes'),
 ('Romania', 10.59, 'yes'),
 ('Romania', 11.24, 'yes'),
 ('Slovakia', 9.65, 'yes'),
 ('Spain', 10.45, 'yes'),
 ('Spain', 10.85, 'yes'),
 ('Spain', 11.19, 'yes'),
 ('Spain', 11.41, 'yes'),
 ('Spain', 11.63, 'yes'),
 ('Spain', 12.62, 'yes'),
 ('Spain', 12.85, 'yes'),
 ('Spain', 13.4, 'yes'),
 ('Spain', 14.17, 'yes'),
 ('Spain', 15.0, 'yes'),
 ('Spain', 15.61, 'yes'),
 ('Spain', 15.78, 'yes'),
 ('Spain', 16.02, 'yes'),
 ('Spain', 16.33, 'yes'),
 ('Spain', 17.09, 'yes'),
 ('Spain', 17.19, 'yes'),
 ('Spain', 17.32, 'yes'),
 ('Spain', 17.38, 'yes'),
 ('United Kingdom', 9.73, 'yes'),
 ('United Kingdom', 9.97, 'yes'),
 ('United Kingdom', 10.14, 'yes')]

In [51]:
# Challenge 3
# ---
# Which EU country had the lowest population?
# ---
# YOUR CODE GOES BELOW
#

%%sql

SELECT country, MIN(population), EU FROM countries WHERE EU = "yes"

 * sqlite://
Done.

[('Luxembourg', 0.58, 'yes')]

## 6. Creating SQL tables

### <font color="blue">Examples</font>

In [52]:
# Example 1
# ---
# As we had seen, we can create a table using the following create table statement.
# If the table doesn't exist, then we create a table with the columns; 
# store_id, name, owner, description, phone, opening_date.
# --- 
#
%%sql 
CREATE TABLE IF NOT EXISTS stores (
    store_id, 
    name, 
    owner, 
    description, 
    phone,
    opening_date
);

 * sqlite://
Done.

[]

In [53]:
# We will then use the SELECT statement to check whether the table has been created. 
#  - Don't worry about the SELECT statement, we will get to practice 
#    more how to use it. For now, just know that statement SELECTs
#    all the records in the specified table.
#  - We use a single % to execute a single sql statement in our notebook environment as shown
# ---
%sql SELECT * FROM stores;

 * sqlite://
Done.

[]

In [54]:
# Example 2
# ---
# While creating our table we can also specify different 
# data types as shown below;  
#
%%sql 
CREATE TABLE IF NOT EXISTS stores_two (
    store_id int, 
    name varchar(60), 
    owner varchar(60), 
    description text, 
    phone varchar(15),
    opening_date date 
); 
SELECT * FROM stores_two;

 * sqlite://
Done.
Done.

[]

In [55]:
# Example 3
# ---
# We can also specify default values while creating our table 
# by use the default keyword as shown below 
# 
%%sql 
CREATE TABLE IF NOT EXISTS stores_three (
    store_id int primary key, 
    name varchar(60), 
    owner varchar(60) default 'Unknown', 
    description text, 
    phone varchar(15),
    opening_date date 
); 
SELECT * FROM stores_three;

 * sqlite://
Done.
Done.

[]

### <font color="green">Challenges</font>

In [56]:
# Challenge 1
# ---
# Question: Create a table named televisions with the following fields; 
# name, model, company, screen, price, warranty. 
# ---
# YOUR CODE GOES BELOW
# 
%%sql
 CREATE TABLE IF NOT EXISTS televisions(
     name varchar(20),
     model varchar(20),
     company varchar(30),
     screen,
     price int,
     warranty
 )

 * sqlite://
Done.

[]

In [62]:
# Challenge 2
# ---
# Question: Create a table called staff that stores staff_number, name, 
# department, salary, phone, address using appropriate data types,
# applying the appropriate datatype and default value of "unknown" for
# for the field phone.
# --- 
# YOUR CODE GOES BELOW
# 

%%sql

CREATE TABLE IF NOT EXISTS staff (
    staff_number int,
    name varchar(20),
    department varchar(20),
    salary int,
    phone default 'unknown',
    addres varchar(20)
);

select * FROM staff

 * sqlite://
Done.
Done.

[]

## 7. Altering SQL tables

### <font color="blue">Examples</font>

In [63]:
# Example 1
# ---
# The name of a table can be changed by doing the following.
# and again check whether our change was made by using the 
# SELECT statement.
# ---
#
%%sql  
ALTER TABLE stores RENAME TO supermarket_stores;

SELECT * FROM supermarket_stores;

 * sqlite://
Done.
Done.

[]

In [64]:
# Example 2
# ---
# We can add a field by doing the following.
# Then check whether our new field was added to the 
# specified table by doing the following.
# ---
#
%%sql 
ALTER TABLE supermarket_stores ADD country;
 
SELECT * FROM supermarket_stores;

 * sqlite://
Done.
Done.

[]

### <font color="green">Challenges</font>

In [66]:
# Challenge 1
# ---
# Rename the table televisions to tvs
# ---
# YOUR CODE GOES BELOW
#

%%sql 

ALTER TABLE televisions RENAME TO tvs;

SELECT * FROM tvs

 * sqlite://
Done.
Done.

[]

In [67]:
# Challenge 2
# ---
# Add a field description with the data type text to televisions table 
# ---
# YOUR CODE GOES BELOW
#

%%sql

ALTER TABLE tvs
ADD text;

SELECT * FROM tvs

 * sqlite://
Done.
Done.

[]

## 8. Dropping a table

### <font color="blue">Examples</font>

In [68]:
# Example 1
# ---
# We can drop (or delete) our table as shown below
# ---
# 
%sql DROP TABLE supermarket_stores;

 * sqlite://
Done.

[]

### <font color="green">Challenges</font>

In [69]:
# Challenge 1
# ---
# Question: Drop the tvs table from our database
# ---
# YOUR CODE GOES BELOW
# 

%sql DROP TABLE tvs;

 * sqlite://
Done.

[]